tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open source relational database management system
brew "mysql"
# Object-relational database system
brew "postgresql"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"

cask "burp-suite"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerized applications and microservices
cask "docker"
cask "eloston-chromium"
# Web browser
cask "firefox"
# Interface for reading and syncing eBooks
cask "kindle"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
cask "redis"
cask "sensiblesidebuttons"
# MySQL/MariaDB database management
cask "sequel-ace"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Collect, organize, cite, and share research sources
cask "zotero"
